result-bun.txt
Running 10s test @ http://127.0.0.1:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.12ms  202.81us  10.71ms   93.99%
    Req/Sec    17.82k     7.72k   30.81k    41.67%
  2127165 requests in 10.00s, 243.43MB read
  Socket errors: connect 156, read 105, write 0, timeout 0
Requests/sec: 212652.51
Transfer/sec:     24.34MB