result-deno.txt
Running 10s test @ http://127.0.0.1:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.70ms    0.90ms  34.22ms   98.56%
    Req/Sec    11.95k     4.13k   20.28k    72.17%
  1427377 requests in 10.00s, 194.66MB read
  Socket errors: connect 156, read 177, write 0, timeout 0
Requests/sec: 142687.76
Transfer/sec:     19.46MB