result-go.txt
Running 10s test @ http://127.0.0.1:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.95ms    3.55ms  60.94ms   91.43%
    Req/Sec    16.03k     7.73k   66.45k    66.33%
  1916635 requests in 10.03s, 221.17MB read
  Socket errors: connect 156, read 106, write 0, timeout 0
Requests/sec: 191111.36
Transfer/sec:     22.05MB