result-ktor.txt
Running 10s test @ http://127.0.0.1:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    16.70ms   20.80ms 276.21ms   92.03%
    Req/Sec     1.72k     0.92k    3.85k    63.82%
  170813 requests in 10.10s, 13.68MB read
  Socket errors: connect 156, read 257, write 0, timeout 0
Requests/sec:  16913.10
Transfer/sec:      1.35MB