result-rust.txt
Running 10s test @ http://127.0.0.1:8080
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.50ms   30.70ms 390.20ms   92.20%
    Req/Sec    19.24k    18.45k  180.46k    84.46%
  2127794 requests in 10.09s, 162.34MB read
  Socket errors: connect 156, read 107, write 0, timeout 0
Requests/sec: 210826.35
Transfer/sec:     16.08MB